{
  "users": [],
  "recipes": [
    {
      "title": "Easy butter chicken",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/butter-chicken-cf6f9e2.jpg?quality=90&webp=true&resize=375,341",
      "description": "Fancy a healthy version of your favourite Friday night chicken curry? The chicken can be marinaded the day before so you can get ahead on your prep",
      "ingredient": "500g skinless boneless chicken thighs\nFor the marinade\n1 lemon, juiced\n2 tsp ground cumin\n2 tsp paprika\n1-2 tsp hot chilli powder\n200g natural yogurt\nFor the curry\n2 tbsp vegetable oil\n1 large onion, chopped\n3 garlic cloves, crushed\n1 green chilli, deseeded and finely chopped (optional)\nthumb-sized piece ginger, grated\n1 tsp garam masala\n2 tsp ground fenugreek\n3 tbsp tomato purée\n300ml chicken stock\n50g flaked almonds, toasted\nTo serve (optional)\ncooked basmati rice\nnaan bread\nmango chutney or lime pickle\nfresh coriander\nlime wedges",
      "steps": "STEP 1\nIn a medium bowl, mix all the marinade ingredients with some seasoning. Chop the chicken into bite-sized pieces and toss with the marinade. Cover and chill in the fridge for 1 hr or overnight.\n\nSTEP 2\nIn a large, heavy saucepan, heat the oil. Add the onion, garlic, green chilli, ginger and some seasoning. Fry on a medium heat for 10 mins or until soft.\n\nSTEP 3\nAdd the spices with the tomato purée, cook for a further 2 mins until fragrant, then add the stock and marinated chicken. Cook for 15 mins, then add any remaining marinade left in the bowl. Simmer for 5 mins, then sprinkle with the toasted almonds. Serve with rice, naan bread, chutney, coriander and lime wedges, if you like."
    },
    {
      "title": "Easy classic lasagne",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/classic-lasange-4a66137.jpg?quality=90&webp=true&resize=375,341",
      "description": "Kids will love to help assemble this easiest ever pasta bake with streaky bacon, beef mince, a crème fraîche sauce and gooey mozzarella",
      "ingredient": "1 tbsp olive oil\n2 rashers smoked streaky bacon\n1 onion , finely chopped\n1 celery stick, finely chopped\n1 medium carrot , grated\n2 garlic cloves , finely chopped\n500g beef mince\n1 tbsp tomato purée\n2 x 400g cans chopped tomatoes\n1 tbsp clear honey\n500g pack fresh egg lasagne sheets\n400ml crème fraîche\n125g ball mozzarella , roughly torn\n50g freshly grated parmesan\nlarge handful basil leaves , torn (optional)",
      "steps": "STEP 1\nHeat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\n\nSTEP 2\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\n\nSTEP 3\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\n\nSTEP 4\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\n\nSTEP 5\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like."
    },
    {
      "title": "Lemony prawn & courgette tagliatelle",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lemony-prawn-courgette-tagliatelle-ff68a02.jpg?quality=90&webp=true&resize=375,341",
      "description": "Make this king prawn and courgette tagliatelle in just 20 minutes. It's full of garlic, lemon and chilli, and it's healthy too, so it's great for busy weeknights",
      "ingredient": "2 tbsp olive oil\n2 courgettes (about 500g), trimmed and coarsely grated\n1 large garlic clove , finely grated\n1 small red chilli , finely chopped\n180g tagliatelle\n150g raw king prawns , peeled and deveined\n1 lemon , zested and juiced\n½ small bunch of parsley , finely chopped",
      "steps": "STEP 1\nHeat the oil in a frying pan and fry the courgette for 4-5 mins, then stir through the garlic and chilli.\n\nSTEP 2\nCook the tagliatelle following pack instructions. Drain, reserving some of the cooking water.\n\nSTEP 3\nAdd the prawns to the courgette mixture, and cook for 2 mins until pink. Toss through the tagliatelle, the lemon zest and juice, parsley, some seasoning and a splash of the reserved cooking water. Divide between bowls and serve."
    },
    {
      "title": "White chocolate cake",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2011/08/white-chocolate-cake-5c2e77a.jpg?quality=90&webp=true&resize=375,341",
      "description": "Bake our easy white chocolate traybake with creamy icing and get creative with toppings. These bite-sized cakes are ideal for sharing or bake sales",
      "ingredient": "250g pack butter , softened\n300g self-raising flour\n250g golden caster sugar\n½ tsp baking powder\n4 eggs\n150ml pot natural yogurt\n3 tbsp milk\n1 tsp vanilla paste\n200g bar white chocolate , half chopped\n300g soft cheese , not fridge cold\n100g icing sugar , sifted\nsweets , to decorate",
      "steps": "STEP 1\nHeat oven to 180C/160C fan/gas 4. Grease a 20 x 30cm tin, then line with baking parchment. Beat the butter, flour, sugar, baking powder, eggs, yogurt, milk and vanilla until lump-free. Stir in the chopped chocolate. Spoon into tin; bake for 25-30 mins until golden and risen and a skewer comes out clean. Cool in the tin.\n\nSTEP 2\nMelt the rest of the chocolate. Stir icing sugar into soft cheese, then the chocolate until smooth. Chill, spread over the cake, then cut into squares and decorate."
    }
  ]
}